src/Reports/КодыМаркировкиДляДекларацииИСМП/КодыМаркировкиДляДекларацииИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>КодыМаркировкиДляДекларацииИСМП</name>
</mdclass:Report>

src/InformationRegisters/СтатусыДокументовИСМП/СтатусыДокументовИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДокументовИСМП</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбработкиВозвратаВОборотИСМП</types>
      <types>EnumRef.СтатусыОбработкиПеремаркировкиТоваровИСМП</types>
      <types>EnumRef.СтатусыОбработкиВыводаИзОборотаИСМП</types>
      <types>EnumRef.СтатусыОбработкиПриемкиТоваровИСМП</types>
      <types>EnumRef.СтатусыОбработкиСписанияКодовМаркировкиИСМП</types>
      <types>EnumRef.СтатусыОбработкиОтгрузкиТоваровИСМП</types>
      <types>EnumRef.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП</types>
      <types>EnumRef.СтатусыОбработкиУточненияСведенийОКодахМаркировкиИСМП</types>
      <types>EnumRef.СтатусыОбработкиМаркировкиТоваровИСМП</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие1</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюИСМП</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие2</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюИСМП</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие3</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюИСМП</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументыИСМП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ДальнейшиеДействияПоВзаимодействиюИСМП/ДальнейшиеДействияПоВзаимодействиюИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДальнейшиеДействияПоВзаимодействиюИСМП</name>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ЗапроситеКодыМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанные</name>
  </enumValues>
  <enumValues>
    <name>ОтменитеОперацию</name>
  </enumValues>
  <enumValues>
    <name>ОтменитеПередачуДанных</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеОбмен</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПередачуДанныхРегламентнымЗаданием</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеЗавершенияОбработкиДанныхИСМП</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеАгрегацию</name>
  </enumValues>
  <enumValues>
    <name>ЗаблокируйтеКодыМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеПеремаркировку</name>
  </enumValues>
  <enumValues>
    <name>ЗапроситеGTINНаОстатки</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеПоступление</name>
  </enumValues>
  <enumValues>
    <name>АннулируйтеОтгрузку</name>
  </enumValues>
  <enumValues>
    <name>ЗапроситеВходящиеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ОткажитесьОтНакладной</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеПроверку</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеОтчет</name>
  </enumValues>
  <enumValues>
    <name>СогласиеОПредоставлениеИнформации</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеФормированиеАТК</name>
  </enumValues>
  <enumValues>
    <name>ЗапроситеИдентификаторСоединения</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеОтчетСИсправлениями</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанныеСИсправлениями</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеАгрегациюСИсправлениями</name>
  </enumValues>
  <enumValues>
    <name>СоздайтеШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеИндивидуализациюКИЗ</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеПоступлениеСИсправлениями</name>
  </enumValues>
  <enumValues>
    <name>ЗакройтеЗаказНаЭмиссию</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеПолучениеКодовМаркировки</name>
  </enumValues>
  <enumValues>
    <name>АннулируйтеВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>ЗапроситеКвитанцию</name>
  </enumValues>
</mdclass:Enum>

src/Reports/КодыМаркировкиДляДекларацииИСМП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	НастройкиОтчета.ДополнительныеСвойства.Вставить("ИмяОтчета", Метаданные().Имя);
	
	ВнешниеНаборыДанных = Неопределено;
	ОтчетыИСМП.ПриКомпоновкеРезультата(НастройкиОтчета, ВнешниеНаборыДанных);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере = Истина;
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   Отказ - Булево - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Булево - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = Форма.Параметры;
	
	Если Параметры.Свойство("ПараметрКоманды") Тогда
		
		Если ЗначениеЗаполнено(Параметры.ПараметрКоманды) Тогда
			ДальнейшееДействие = РегистрыСведений.СтатусыДокументовИСМП.ТекущееСостояние(Параметры.ПараметрКоманды).ДальнейшееДействие1;
			Если ДальнейшееДействие <> Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ПередайтеДанные
				И ДальнейшееДействие <> Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ПередайтеДанныеСИсправлениями Тогда
				Отказ = Истина;
				Если ДальнейшееДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.НеТребуется Тогда
					ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Документ обработан. Выгрузка кодов в декларацию не требуется'"));
				Иначе
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = '%1 перед выгрузкой кодов в декларацию'"), Строка(ДальнейшееДействие)));
				КонецЕсли;
				Возврат;
			КонецЕсли;
			Форма.ФормаПараметры.Отбор.Вставить("ДокументИСМП", Параметры.ПараметрКоманды);
		КонецЕсли;
		ОтчетыИС.УстановитьПараметр(КомпоновщикНастроек.Настройки, "ДокументИСМП", Параметры.ПараметрКоманды);
	КонецЕсли;
	
	ОтчетыИС.ИнициализироватьСхемуКомпоновки(ЭтотОбъект, Форма);
	
КонецПроцедуры

// Часть запроса отвечающего за данные прикладных документов
//
// Возвращаемое значение:
//   Строка - переопределяемая часть отчета о расхождениях
//
Функция ПереопределяемаяЧасть() Экспорт
	
	Возврат ОтчетыИС.ШаблонПолученияДанныхПрикладныхДокументов() + ИнтеграцияИСМП.ШаблонПолученияВидаПродукцииИзНоменклатуры();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
